/*
程序名：统计字符.cpp
程序功能：统计输入的字符串中的英文字母，数字字符，空格，其他字符的个数
作者：陆宣臣
日期：2023.3.13
*/
#include <iostream>
using namespace std;
int main()
{
    int d, x, m, q, k,i;                             //定义大写小写数字空格其他字符的变量
    char ch[81];                                     //定义输入的字符串
    d = x = m = q = k = 0;                           //累加和赋值为0
    gets_s(ch);                                      //输入字符串
    for(i=0;ch[i]!='\0';i++){                        //一个一个判断知道到字符串末尾
        if (ch[i] >= 'A' && ch[i] <= 'Z')            //判断是否大写字母
            d+=1;
        else if (ch[i] >= 'a' && ch[i] <= 'z')       //判断是否小写字母
            x+=1; 
        else if (ch[i] == ' ')                       //判断是否空格字母
            k+=1;
        else if (ch[i] >= '0' && ch[i] <= '9')       //判断是否数字字母
            m+=1;
        else                                         //其他字符
            q+=1; 
    }
    cout << "大写字母有：" << d << "个"<< endl;      //提示信息
    cout << "小写字母有：" << x << "个" << endl;     //提示信息
    cout << "数字字母有：" << m << "个" << endl;     //提示信息
    cout << "空格字母有：" << k << "个" << endl;     //提示信息
    cout << "其他字母有：" << q << "个" << endl;     //提示信息
    return 0;
}
