/*
程序名：体质指数.cpp
程序功能：体重（Kg)/((身高（m）*身高（m))通过此公式计算成年人的体质指数
作者：陆宣臣
日期：2023.3.6
*/
#include <iostream>
using namespace std;
int main()
{
    float wt, hg;  //定义体重和身高的变量
    float tz;   //定义体质指数
    cout << "请输入你的体质指数:\n";  //提示信息
    cin >> wt >> hg;   //输入体重和身高
    tz = wt / (hg * hg);  //计算体质指数
    if (tz < 18.5)   //判断范围
        cout << "如果成年人的体重为" << wt << "kg"\
        <<",身高为" << hg << "m" << ",那么他的体质指数BMI为"<< \
        wt << '/' << "(" << hg << '*' << hg << ')' << '=' << tz << ",属于偏瘦范围" << endl;
    else if(tz<24)  //继续判断
        cout << "如果成年人的体重为" << wt << "kg"\
        << ",身高为" << hg << "m" << ",那么他的体质指数BMI为" << \
        wt << '/' << "(" << hg << '*' << hg << ')' << '=' << tz << ",属于正常范围" << endl;
    else if(tz<28)  //判断
        cout << "如果成年人的体重为" << wt << "kg"\
        << ",身高为" << hg << "m" << ",那么他的体质指数BMI为" << \
        wt << '/' << "(" << hg << '*' << hg << ')' << '=' << tz << ",属于偏胖范围" << endl;
    else if(tz<40)//判断
        cout << "如果成年人的体重为" << wt << "kg"\
        << ",身高为" << hg << "m" << ",那么他的体质指数BMI为" << \
        wt << '/' << "(" << hg << '*' << hg << ')' << '=' << tz << ",属于肥胖范围" << endl;
    else  //判断
        cout << "如果成年人的体重为" << wt << "kg"\
        << ",身高为" << hg << "m" << ",那么他的体质指数BMI为" << \
        wt << '/' << "(" << hg << '*' << hg << ')' << '=' << tz << ",属于极重度肥胖范围" << endl;
    return 0;
}