/*
程序名：分糖果.cpp
程序功能：输入甲乙丙最初的糖果数，输出甲乙丙最后分得的糖果数。
作者：陆宣臣
日期：2023.2.17
*/
#include <iostream>
using namespace std;
int main()
{
	int x, y, z;   //定义甲乙丙糖果数量的变量
	cout << "请输入甲乙丙最初的糖果数:" << endl;  //输入甲乙丙的糖果数的提示信息
	cin >> x >> y >> z;                           //输入甲乙丙的糖果数
	x = x / 3;         //先分甲的糖果，三份平均分
	y = y + x;         //乙的糖果数量增加
	z = z + x;         //丙的糖果数量增加

	y = y / 3;         //分乙的糖果，三份平均分
	x = x + y;         //甲的糖果数量增加
	z = z + y;         //丙的糖果数量增加

	z = z / 3;         //分丙的糖果，总共的平均分
	x = x + z;         //甲的糖果数量增加
	y = y + z;         //乙的糖果数量增加
	cout <<"甲的糖果数量:" << x<<endl<<"乙的糖果数量:" << y<<endl<<"丙的糖果数量:" << z;   //输出分配之后糖果的数量
	return 0;     //结束
}