/*
程序名：输出各位和位数以及逆序后.cpp
程序功能：输入一个整数算出他的各位数字之和和整数的位数还有逆序输出
作者：陆宣臣
日期：2023.3.13
*/
#include <iostream>
using namespace std;
int main()
{
    int x,y,s=0,b=0,c=0;                     //定义各位和的变量和位数变量以及逆序存储变量
    cout << "请输入一个任意的整数"<<endl;    //输入提示信息
    cin >> x;
    y = x;                                   //存在另一个变量，否则原数会丢失
    while (y % 10 != 0) {                    //计算各位数之和
        s += y % 10;
        y /= 10;
    }
    y = x;                                   //重新赋值，下面是计算该数几位
    while (y != 0) {
        b = b + 1;
        y /= 10;
    }
    while (x) {                              //计算逆序输出
        c = c * 10 + x % 10;
        x /= 10;
    }
    cout << "该数各位数字之和是：" << s<<endl;  //提示输出信息
    cout << "该数位数是：" << b << endl;        //提示输出信息
    cout << "该数逆序是：" << c << endl;        //提示输出信息
    return 0;
}
